# Dementia Individuals: Assesment Center

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
cd /Users/marinacamachosanz/Desktop/tfg_BCN-AIM/outputbashfiles/

/Users/marinacamachosanz/Desktop/tfg_BCN-AIM/outputbashfiles

In [3]:
alld_types = pd.read_csv("eid_types_after_no_before_alld.csv")
sex = pd.read_csv("f.alld_31.tab", delimiter="\t")
center = pd.read_csv("f.alld_54.tab", delimiter="\t")

In [4]:
# I sorted both files in increasing order by patients eids with are unique and common and re-set the index for
# convinience. We will end up having both dataframes equally arranged.
alld_types = alld_types.sort_values(['f.eid'], axis=0,ascending=[True])
alld_types = alld_types.reset_index()
del alld_types["index"]

sex = sex.sort_values(['f.eid'], axis=0,ascending=[True])
sex = sex.reset_index()
del sex["index"]

center = center.sort_values(['f.eid'], axis=0,ascending=[True])
center = center.reset_index()
del center["index"]

In [5]:
alld_types_s_c = alld_types
alld_types_s_c['sex'] = sex['f.31.0.0']
alld_types_s_c['center'] = center['f.54.0.0']

In [7]:
#Female==0 690
#Male==1 834
alld_types_s_c['sex'].value_counts()

1    834
0    690
Name: sex, dtype: int64

In [8]:
alld_types_s_c

        f.eid  AD  VD  FTD  OD  ALLD  sex   center
0     1001966   0   0    0   1     1    1  11010.0
1     1010250   1   0    0   0     1    0  10003.0
2     1010978   0   0    1   0     1    1  11014.0
3     1012610   1   0    0   0     1    0  11007.0
4     1012759   0   0    0   1     1    1  11008.0
...       ...  ..  ..  ...  ..   ...  ...      ...
1519  6008501   0   0    0   1     1    1  11013.0
1520  6010541   0   1    0   0     1    1  11001.0
1521  6015818   0   0    0   1     1    1  11009.0
1522  6017694   0   1    0   0     1    1  11002.0
1523  6018195   1   0    0   0     1    1  11007.0

[1524 rows x 8 columns]

In [9]:
alld_types_s_c=alld_types_s_c.replace([10003.0,11001.0,11002.0,11003.0,11004.0,11005.0,11006.0,11007.0,11008.0,11009.0,11010.0,11011.0,11012.0,11013.0,11014.0,11016.0,11017.0,11018.0,11020.0,11021.0,11022.0,11023.0], ['stockport','manchester','oxford','cardif','glasgow','edimburgh','stoke','reading','buty','newcastle','leeds','bristol','barts','nottingham','sheffield','liverpool','middlesborough','hounslow','croydon','birmingham','swansea','wrexham'])

In [11]:
alld_types_s_c['center'].value_counts()

leeds             150
buty              132
newcastle         127
liverpool         115
nottingham         94
bristol            94
sheffield          77
middlesborough     75
reading            74
manchester         69
oxford             65
stoke              64
croydon            62
hounslow           61
birmingham         57
glasgow            55
barts              45
edimburgh          43
cardif             35
stockport          24
swansea             4
wrexham             2
Name: center, dtype: int64

In [ ]:
# As alld_types_s_c.shape[0]*10/100 = 152.4
# oxford 65 + barts 45 + edimburg 43 = 153

In [112]:
(alld_types_s_c.shape[0]-1)*10/100

152.3

In [59]:
external_validation = ['oxford','barts','edimburg']

In [91]:
alld_types_s_c

        f.eid  AD  VD  FTD  OD  ALLD  sex      center
0     1001966   0   0    0   1     1    1       leeds
1     1010250   1   0    0   0     1    0   stockport
2     1010978   0   0    1   0     1    1   sheffield
3     1012610   1   0    0   0     1    0     reading
4     1012759   0   0    0   1     1    1        buty
...       ...  ..  ..  ...  ..   ...  ...         ...
1519  6008501   0   0    0   1     1    1  nottingham
1520  6010541   0   1    0   0     1    1  manchester
1521  6015818   0   0    0   1     1    1   newcastle
1522  6017694   0   1    0   0     1    1      oxford
1523  6018195   1   0    0   0     1    1     reading

[1524 rows x 8 columns]

In [100]:
input_alld = alld_types_s_c[alld_types_s_c["center"].str.contains('oxford|barts|edimburg')==False]

In [103]:
input_alld_external_validation = alld_types_s_c[alld_types_s_c["center"].str.contains('oxford|barts|edimburg')==True]

In [108]:
x_nan_alld = pd.read_csv("/Users/marinacamachosanz/Desktop/tfg_BCN-AIM/matrius/x_nan_alld.csv")

In [140]:
eids_del = str(list(set(alld_types_s_c['f.eid']) - set(x_nan_alld['f.eid']))[0])

In [141]:
alld_types_s_c['f.eid'] = alld_types_s_c['f.eid'].astype(str)

In [142]:
alld_types_s_c_f = alld_types_s_c[alld_types_s_c["f.eid"].str.contains(eids_del)==False]

In [144]:
alld_types_s_c_f['center'].value_counts()

leeds             150
buty              131
newcastle         127
liverpool         115
nottingham         94
bristol            94
sheffield          77
middlesborough     75
reading            74
manchester         69
oxford             65
stoke              64
croydon            62
hounslow           61
birmingham         57
glasgow            55
barts              45
edimburgh          43
cardif             35
stockport          24
swansea             4
wrexham             2
Name: center, dtype: int64